#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/commerceprowess/notejam-infrastructure/runs/run-k8tqJD44vbuF9QH2

Waiting for the plan to start...

Terraform v1.1.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.notejam-infra-production-regional_pair_a.azurerm_resource_group.main: Refreshing state... [id=/subscriptions/1dfa3ab0-d7c3-40ca-9db1-41c3a35266e7/resourceGroups/notejam-prod-rg]
module.notejam-infra-non_production-regional_pair_a.azurerm_resource_group.main: Refreshing state... [id=/subscriptions/1dfa3ab0-d7c3-40ca-9db1-41c3a35266e7/resourceGroups/notejam-nonprod-rg]
module.notejam-infra-production-regional_pair_a.azurerm_kubernetes_cluster.main: Refreshing state... [id=/subscriptions/1dfa3ab0-d7c3-40ca-9db1-41c3a35266e7/resourceGroups/notejam-prod-rg/providers/Microsoft.ContainerService/managedClusters/k8s-prod-westeurope-cluster]
module.notejam-infra-non_production-regional_pair_a.azurerm_kubernetes_cluster.main: Refreshing state... [id=/subscriptions/1dfa3ab0-d7c3-40ca-9db1-41c3a35266e7/resourceGroups/notejam-nonprod-rg/providers/Microsoft.ContainerService/managedClusters/k8s-nonprod-westeurope-cluster]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.notejam-infra-production-regional_pair_a.azurerm_kubernetes_cluster.main has been deleted
  - resource "azurerm_kubernetes_cluster" "main" {
      - api_server_authorized_ip_ranges     = [] -> null
      - automatic_channel_upgrade           = "" -> null
      - disk_encryption_set_id              = "" -> null
      - dns_prefix                          = "k8s-prod-westeurope-cluster" -> null
      - dns_prefix_private_cluster          = "" -> null
      - enable_pod_security_policy          = false -> null
      - fqdn                                = "k8s-prod-westeurope-cluster-ebc48ed3.hcp.westeurope.azmk8s.io" -> null
      - id                                  = "/subscriptions/1dfa3ab0-d7c3-40ca-9db1-41c3a35266e7/resourceGroups/notejam-prod-rg/providers/Microsoft.ContainerService/managedClusters/k8s-prod-westeurope-cluster" -> null
      - kube_admin_config                   = [] -> null
      - kube_admin_config_raw               = (sensitive value)
      - kube_config                         = [
          - {
              - client_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUZIVENDQXdXZ0F3SUJBZ0lRWXZtRm0vcXl2YVltdWdpSFFvdlJGekFOQmdrcWhraUc5dzBCQVFzRkFEQU4KTVFzd0NRWURWUVFERXdKallUQWVGdzB5TWpBeE1qSXdORFU1TURsYUZ3MHlOREF4TWpJd05UQTVNRGxhTURBeApGekFWQmdOVkJBb1REbk41YzNSbGJUcHRZWE4wWlhKek1SVXdFd1lEVlFRREV3eHRZWE4wWlhKamJHbGxiblF3CmdnSWlNQTBHQ1NxR1NJYjNEUUVCQVFVQUE0SUNEd0F3Z2dJS0FvSUNBUUNpUUxCVzZnc284d0FWZ2VzZjQycE0KWHhQYmM1TEJBdXQyakZnc2hsMHlsa0RaN2U0czFmNk9nQlVaT2FVUDdHMklZbW9tVmVsUCsxYmlVa1dGcVFnVwpRYmNYSStabGFNQ2RuMEZNemFRWmtTbE5JbFdNQlQvSG5YUUhPSlpvWUFxOWZQZGVQNDgvUlZleVFiaEtUR1JZCjc3Y1pxTjlHVjgxK2RGLzhadHp5bFduUHR0NXQ0aFo2TEkxL3RGbHAxaEV6N2RINXdSbEcxMVRiSHo0RGZOUHIKV0JSOFg0WnFkN3dJWk91ZUt5Q0V1c3NxM2FVUWpJOUovUEZ6L3Y5UVUwNHJsbmJydmM2bTRPME9WTUhOVk9TcgpYbGQrdSt6L0N5dndNZll5aS9DN28yNmVIU0twNk5jVy9tTENKRHJ6RG9lTWpJWHdkL1NlMWNsVUcvUm1STVBzCithUnVPVjRoZm9uWHdKRjZLdmtCVElicXpmZElnRHlpN2VWR00xQW9HcmNIUkxZUFZBS2MwUEJCc3FLNldIYksKN3d4Mm1qaExmZzArYWNWbWZyaUNIRXdSWmxEbERMUEwvNTZaa0JudXd5S1RnYyt4RTZvSXMvRHJsV0NmcE5PVwpSb3NDaE1iQ1Y1MnQyL2ZGMUVNaDA5WitQMmh0UUNhUzZkN3NVSmRLczM3Q3poVEgvdDFaTjVXWkdqOVdKT3RiCkNRM3ZqLzVGNTMwVEVmbk5kU0FvcEVPQWtkbHYxaWxHVEVSaHE5c0xENkkzNE01Wk5nNXMwcXpkK01IM1lPSEQKT0pMR1FvTGVkZW11WUh3Qm9sV1pmOEYrYnVvVUlNVTFFK3hyeThyQUs4OGxlUUZPY0dEOVZzT1dqRFduZGZ0VQo5bDNxRStvQklodWs2Zzh3eHpXb1B3SURBUUFCbzFZd1ZEQU9CZ05WSFE4QkFmOEVCQU1DQmFBd0V3WURWUjBsCkJBd3dDZ1lJS3dZQkJRVUhBd0l3REFZRFZSMFRBUUgvQkFJd0FEQWZCZ05WSFNNRUdEQVdnQlNNMVVrR0pWLzgKMjMwVjVwV1k1WEJZekZNMUtUQU5CZ2txaGtpRzl3MEJBUXNGQUFPQ0FnRUFPMHlkRGxUM1gzNzBpaHg2VE04RQpmWVpicyt2V0daNUhxNHV2VFIrM3JUdDlXREpQbU56VkJ6ZXczMDRIOUZhK2orSHNrcjVHbUJDSURnYzluMVNYCnlTeHg5WW9kNDNmSHdnYmxTL2dWU1QzYWVSWTZNUEI3TGJPek84QUhxZG5RR3Bvd0NSNGMrbTRSWTY5Q0xGUzUKSXBkdGNTZ2NDOXJzYTNZSVhuc3RpcGtxZm5xMmxjaXRLbmFVa3FUNlUyU0pHMVgyQldrcmhBWnVXK0o1ZVJ4Kwo1OEJQMlViMnp6S3dwWWhWdlE0eFJUaFA4akxIbkhSRGI5K2ZuVGttNm84dDI5aTh0ZkRwZndCbGg3d2dNdjhrCmRWQ3loMVFiUk8vVktOM3QrOEN3VmxsWkdmWHljblZ2ZjlvVG16M0djVHNxSzVOQzBST1h1N01HZUR3TSt2MFgKdUxxYTRXNzh0YVU2SzIvaktUbW01NG02NGUxOXAySkdsd1VzTUdkQVVDak9vS2k3aHBQTnpkQXh0Q2UydXpXdAp4WGZYdHRDbWd5OXpiS3p3eUtWM1ZrQ1RsRXpySUk0d0srdDMyRHoxNElDaDhVNFBIVUFoU3E0R1FhN3ZWUVZPCkRmUVdNcFA2RFhPOHlrZW5HU0plaXdlZ1U3T0paR0FJcUljK1p0MWFzRFRScVhvRXE0VjBpYzZuUm8rM3Q2Y3cKaDNxQVc1TVJRY1huL3ErcUJkbDJkZFQ2TmRhTlEvcnoxZVNvSGdvekQ4VUJUYW9YcmtrQU5HWVlHazFubGcwVgpKVzBzMXpnYzcvMFVoVDJrbnNjQitQUlpZZUNJNlU3NFJmMXdTMlYzVXhDak5PNEgvNGI2Wk00VGdwdkZRei9mCnpUbnZDT2wxckdtUWFPeU04ZWpGRk5BPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
              - client_key             = "LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlKS1FJQkFBS0NBZ0VBb2tDd1Z1b0xLUE1BRllIckgrTnFURjhUMjNPU3dRTHJkb3hZTElaZE1wWkEyZTN1CkxOWCtqb0FWR1RtbEQreHRpR0pxSmxYcFQvdFc0bEpGaGFrSUZrRzNGeVBtWldqQW5aOUJUTTJrR1pFcFRTSlYKakFVL3g1MTBCemlXYUdBS3ZYejNYaitQUDBWWHNrRzRTa3hrV08rM0dhamZSbGZOZm5SZi9HYmM4cFZwejdiZQpiZUlXZWl5TmY3UlphZFlSTSszUitjRVpSdGRVMng4K0EzelQ2MWdVZkYrR2FuZThDR1RybmlzZ2hMckxLdDJsCkVJeVBTZnp4Yy83L1VGTk9LNVoyNjczT3B1RHREbFRCelZUa3ExNVhmcnZzL3dzcjhESDJNb3Z3dTZOdW5oMGkKcWVqWEZ2NWl3aVE2OHc2SGpJeUY4SGYwbnRYSlZCdjBaa1REN1Bta2JqbGVJWDZKMThDUmVpcjVBVXlHNnMzMwpTSUE4b3UzbFJqTlFLQnEzQjBTMkQxUUNuTkR3UWJLaXVsaDJ5dThNZHBvNFMzNE5QbW5GWm42NGdoeE1FV1pRCjVReXp5LytlbVpBWjdzTWlrNEhQc1JPcUNMUHc2NVZnbjZUVGxrYUxBb1RHd2xlZHJkdjN4ZFJESWRQV2ZqOW8KYlVBbWt1bmU3RkNYU3JOK3dzNFV4LzdkV1RlVm1Sby9WaVRyV3drTjc0LytSZWQ5RXhINXpYVWdLS1JEZ0pIWgpiOVlwUmt4RVlhdmJDdytpTitET1dUWU9iTktzM2ZqQjkyRGh3emlTeGtLQzNuWHBybUI4QWFKVm1YL0JmbTdxCkZDREZOUlBzYTh2S3dDdlBKWGtCVG5CZy9WYkRsb3cxcDNYN1ZQWmQ2aFBxQVNJYnBPb1BNTWMxcUQ4Q0F3RUEKQVFLQ0FnQTYxTC9iMCtNV0J2NUp6aURHSUR5RDBwbXRvYnRkbHNSdjZMVno5NGhGZG11dldYRlorb0hoZzVtaQoydDc1NWgxVkxYSVYwbUxWcUdtNWlHRkM5S1pGQTdEeWlBYmJVRjgvQitheWhZSHg3MHVOZDF5VGQ3ZkhsbFRpCjVXYk1FNzd4TkNXeG05UkIrYyt4aDlqZHY5TkcyQ3lJOWsxM0FSRTJ2OVdwL0ZZeTgzQTVhN0k5SDVSTTJtaTQKSEZtcllYNDlXUWNneXg1eUxGUE5YQWV0Vmc2MUwrdkZxUkZnKzJkSGwraERJcG9ZNW00U2JlbVRGWlJESEo4awpFeHJhTWtxT3pYRHpTNUJwdS9iWWttenZHZEFNUHhuMGp3bUE5TGtLeitMWU14dW52YnUzUXhNMWpvS25DTGdnCmN1aVpCdlNwUnE2dUlhQ21FeGg4RWVMTlRqUEgzbXVHTzZHK0ZHeGhiakJYKzRaRENQUlkwYW0ydWZ3bDF5MDQKWFV3V3h1ZE10UDFrTW02L1Z1bjJFcDl0MGM0amFWRDFLWGJ5ZXRhK3Fkd2JLeS85UW9aN0I3aDh5QWZucENrMQpJcmlFd0RnQmk1Z29rKzMrSW95RUFDK0VsMGZIZzFVdkZlZ2dLVzhFZFQyQnlXOUJ6VUtSeXlVSmVvWW1UazI0CmJlTXFENlRKSVQ5aFB6U3NmaXh1akZmSFZmaTJIZHNWT1VWdEVaVldDUExvT01XRGZ3SjZtQXc4dkJyeXN0VWQKSStiRmhOT2MrTDVkY1dMMUNTWW8wK3pTNHVKQ2dabEdST1hZUmlvWWRSdVREdHlhNlZmWE5jckJaa1VtTXNXSApVM3Vqckw3YWRiT1U1NUJqdU1ESXkvZHhiUDBRSVlDVnlxOU9wcTN1dW5DKzBTMlhXUUtDQVFFQTBGN1Zza3hRClBJeVpwR1lUbkNMUHdQMUs2Q2FUMHVubFBuN1FNeXppOHlZU1ZkLzVEc2VuZ0RrSkI4V3FQQno5WE56TnF5OU0KQ0FGdjBKSDVxNmJWemIzZE1mM2ZvUmhscmFkcEljNlE0akhwVTJjbTA5UjNoaGZ1QmpOVGdNQXUrUklaSUNKdApuREdXZXRjL2lWVStGenkxc2tFamJXUHhWM1BoMkhtRlNrdWVSY1A0dXJNUWQwaHJuai9kd0FDVnBlR0NSa1NVCi9mL1ROUXUvb1FtVUowSUNNVGNYbG9BczVVUmIreHVDT1hTT0gweWhGaHB1UXRLd04zSXRGNGo1azlsckJWUjcKbDk4UTJmbEhMZU1JK3FQNHpUM3AwelZiUjJPems4QUE0OW5ZZk1qVC9hVDhVWkl0NkFGQi9UVzM4dVdmajRrYQpLNUtBNzFaai85dThNd0tDQVFFQXgxY3hJeEJLYm1iTWJUcDRZNGJCLzZKNFBmUmh4VmswNkRIeWY4V2hSbVhiCnBUNllKdmdxOVQwT0c0dFNza3BpYXRtTHRuRnhkcjV6ZS9jZUJEYklDcnNzNkt1ZEExd094Rks1ZjBRRHNJU1MKRGMveTNaRXQySUhjNWd1VWh2ZnB0WTNVRlVPSXpaS285ckNQV253dGNMdWUrSEd3N1JVMVdnMmhjbXYyWmVlbAp5WVQ2YXJPRHVYamdURUpQVERiR0lxbVEySlJzWlRhZ0hmMHRjMm5vSFNYQ2tMSE9iNldxTEVjNHU2UUQvNXd2Cm5qTW1QU1ROY2tuMXpJcDcyZUJpUkV2OVpLR0JVcG9WaVBkeEdMSnpmM2tRdjNYYk1qbUs5bTd6RE9nMUEvOEIKU2Eycit5bEFHeEZQVnBVUENQRkE4T094K29QRlhLM3ltanU3bUxYWHhRS0NBUUVBbURJOHluL2ROMnpIS0lKNgpubGY3QVk3Qk1QSkVsUkRNcGlwQWJyREJrREpsd0IzWk1BZDYvRGdzdFdXV28xUFZhQWZMbmRidEpRZlBvVHVPCmJ1ZHNVVnYxL2ZiZWFpK0V6U056c2dMTVpydG9Ic2hBWHdkWXlqUWVZcDhJeGdrYUJrbEcydWJxd3VTaGNsWlkKalRvYklTUHgzeUtlK3Q2K1FFOWZUaHZzMU1pSThaSmowaExLMnlXbG5iQXVpM2loMWNqeXU5cUtMVUM0QjQzdQpTWFRTcHg0YXRkSDB3N1FabHRpb2lyQ2NITlZhbmRmOTdVUWU5MlltMmtqbVVNTjI4SndsQkg2aHk5dGQxcWl5CmFmemo2UmJ0dXhRVy8zT0FtWk5rYm00VytGWjlQeC85WDg0cmtuVkFYSzdXZ1ZuRVk0Ri9XM3NjQjJsNkRkYy8KTVhwUmF3S0NBUUE0SE1Nb0s1M0lGZ2ZWZDNBTUZCTG44c1FHTEpTWkNOTnJ5U09KOUFmQjJVcEs2YVBLMUhERApON3lRNUZjUytQMWJOb0d0aWFGMjI0V0dqN2xUVmxoWkxQY25SNmViR243TnBMdXlwMktpZmE3ZlZIbjVCTFR6CkRSc3habkVZelJCc21zL29iR3BGODlLOEhsYzhFVmg1TTFjOGVFUmxlR0xjUnBuN3E0aGdoeVNUNVdyWVBsQUcKRlpDTjV0eUxoNStlZ2p6VHVuUUl5YWVveVd2UjRTNEZobXVPYjM2OHp0Vm9RV1FtN2JSeWIzUzRBNDN3Q0R3TQp2K1VBL3JwK1NqdGZIa1RsM3RDWWYrY3Y5dmRQREd5V3BXMmhkM3VNVjhaV09FVVNqUXJmWlJqbnRJdUUxOGZECjFzdU9nOGNIcldHcWJXM2NKdHVYaXgrUGF1RVR5NXhCQW9JQkFRQ3FUODFKVjRlQXFPaHFaeFR2QWxQYXpJdzIKeWFheDVhWFVON0lmUVNrZkNXRWN4MDNyZHBQM3dFNDI2Y2hyY0p1V2l0dVl0WmkxZ3lhQXUwbEo4ODhka2hyZwoxcm1JWktKd1l0U2U5WlpnYkRoZHdyM2IxRTRkMlVsY2owUE9ITjZhWlJxWG1LM1poeFpJRmgvbzdJaFBuK3orClI5T3lycTR3WUZzTnBuL3N6cGFZTWpXSnQxZml1enN1Rk1FTFdVRFFuWWcxU1Y3NnhQOFRBWDIyUEIzUGVEbVEKN1lhMGxKa1B1REdPb3Z1YUQwQXBWb1JRMng3UjJBSWU2VDF0MlF5c0kwYlZReUdXUzRNZkFPdVJvSVpYWHJ5NQpWSWdMUG5WdjBBTnhIYlE5ZnRadUVnaU5meDhLN0phOGVaY3dtWVBaYUs3REVKUDRObFlvaDY0ajhvV1kKLS0tLS1FTkQgUlNBIFBSSVZBVEUgS0VZLS0tLS0K"
              - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUU2VENDQXRHZ0F3SUJBZ0lSQU1pSzJVRWVJWmZiVk9DYlQzemxCdDR3RFFZSktvWklodmNOQVFFTEJRQXcKRFRFTE1Ba0dBMVVFQXhNQ1kyRXdJQmNOTWpJd01USXlNRFExT1RBNVdoZ1BNakExTWpBeE1qSXdOVEE1TURsYQpNQTB4Q3pBSkJnTlZCQU1UQW1OaE1JSUNJakFOQmdrcWhraUc5dzBCQVFFRkFBT0NBZzhBTUlJQ0NnS0NBZ0VBCnhKdkM4Z281RW5id0RXTEQxZ29sV3J0N0t4OHB6bjVFS3RsMFhLU3N6QnFadFFmeVN1RTZmR3NaU2Q2azZjM2QKdjFodFlvN3lPMTcvS0xzSndEdHo3a3UzbU1MS1hINXNOb1IyL3JPZExmY0FHUXFPNDVGVG4rNTRGL2JYKzJKRwpndkFpT0ZHMloySkZQU0M4bmN5YmFia05vSTMycUZUNHJOek9jbGNnSjhJbG9xTTk0TkhLODdoaTVlUXlXNW5XClV3UFlMSEpTdFFoTzM5QngydGxuTVVmTTEvbTJqUkZDWUFmOG4zY1RWbnM3T2R6QVFXbkhjd0N2aXBBYXRLelMKWkJ6QTBab3FHNWdJT1Jzd1RudWVKUjliaXVtc3BmcTBMc1I4QXhwQWhGRUtXckZjbDBHWCtFSXdEQmc5ZVk4eQo0clkydXBvMkpOSGlRK00rN2NxS09aSkp4NFMvWGpvOVFjL0FEWldJMXFWaThlRURkLzROam5Xa3IxRU0zWDh1CmNVOWwyVFdVa1NJMjlXTHJtWmJZNGU4K21BdkdjZ3ExMDVFQWtidndRT2VTdXdTN29keUQzQkJRRjJPNkh0M0UKMzZXMW9Hb2E3WjFkZFJkcUNpR3hSdDBET1dCQW5mSngxQVFsM2dyWkFNZlpmUEs2Sk03UjBNSjlPOU90WC85NwowUldGd0lMR1ViWnFOMGtCWkNCRkJMRlptbmp6cjduYThvKzZLRURYdFFSUTViRzN6cTFOZnNBbElvTzZad3JuCnExVFhBNFNwdzl0RC9ISW5GaTdxRWVFWlRFbEQySEpJT3crSlNVaUhyNmQrRWdaWEdWVDNYYVBQbFNDbnAvTVIKNUk2cE5vYTJmZlNhZXJJd2lTWlBCM09zNHNEdUtJdzRnNzFGT1ZORVhpRUNBd0VBQWFOQ01FQXdEZ1lEVlIwUApBUUgvQkFRREFnS2tNQThHQTFVZEV3RUIvd1FGTUFNQkFmOHdIUVlEVlIwT0JCWUVGSXpWU1FZbFgvemJmUlhtCmxaamxjRmpNVXpVcE1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQ0FRQllCcjlhN1RDbE5adStGTzk1UXBacnZYQXcKekZTVzN3UFpaWXpFUDVNV1IwQ2ZXcDFMenExM1hSaGlCQmxXRjNDeW9ZT2ltdndRZDVIUk94TEprdXIrVkhmSgpuTHVEOTZyby9hSmVyZ1BRL1lPZXJqS0RGTXRlQnRLMXhXL3JJNUh3bjBKU2xuYW5JemxGNWVVTEVpNEJ3Ni9wCjZVaWxYOVpiQ3R2bDI4Zlhabkh5YXQzRWM0ZDMzUVB6R0REY2l6TG9LZ2VYQkI5SHdSdURXMXNBbThpTkZSVWwKV1pkUUx1b2M2bHZrRnFxS0ZTWTE5UzV4Z0lBTjZmUXJEMFA4WWlaeFJ0N290aEhrdkUxK296UWJ5TDRHWkM2dgpQSkhKelVxZUR5UWxhejRINWM1QytUSXRBWWlHeC96N1ZsSzFGUkZFeUlYQTdiTlp4VlBRdWIrZ1hQVEVaUDRWClg4UmhiU2Rrdkp1M1dmSzExcVBNSC9TRW51czVPdWtCVmQ5dFFrTEhPbjhON3h3bStzR3pBelBxVDdrV2FEajAKR0RxWCtsRXNTZmpYOStVU2VabDRHSlpvaXZsMHJUV2taMC9xRGVGeG1uSUVkSUNRNkY4STVBNE1BRWd2NUFSOQpCOUZWSklnUitsRHVGRGdiajk1OXVVYVlVdFhqNjNEcUE2SlQ2NnFiTDAwamg2WjdrMm9PSW16d3R0cXBRQ09WClVUZkV4RTNyNVdpcHBObWVTMlQ1bC9VQlhEcVVncW8wVDRCck9jeHdQMkMzVFFSeXNxeUZQSzcrRlZ0dWJsRWoKajRETEh5am81MmlsenltbDlmaHQra3FjeG5IQ1JIazBFdUFqZVB2dXpiWDQzck5YSEl4eHk4bUJiUWl1TnNBcQo5QnQ1NDBySnV4SGh6RHJRM0E9PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
              - host                   = "https://k8s-prod-westeurope-cluster-ebc48ed3.hcp.westeurope.azmk8s.io:443"
              - password               = "34ca5e9d9a015334e49101fc7495932509f4bc561e8cb6548f272002a91a53c2d37a617cca848c68671dbac2dca656ff053dec3b9e5cef21821996ea6715a860"
              - username               = "clusterUser_notejam-prod-rg_k8s-prod-westeurope-cluster"
            },
        ] -> null
      - kube_config_raw                     = (sensitive value)
      - kubernetes_version                  = "1.21.7" -> null
      - local_account_disabled              = false -> null
      - location                            = "westeurope" -> null
      - name                                = "k8s-prod-westeurope-cluster" -> null
      - node_resource_group                 = "MC_notejam-prod-rg_k8s-prod-westeurope-cluster_westeurope" -> null
      - portal_fqdn                         = "k8s-prod-westeurope-cluster-ebc48ed3.portal.hcp.westeurope.azmk8s.io" -> null
      - private_cluster_enabled             = false -> null
      - private_cluster_public_fqdn_enabled = false -> null
      - private_dns_zone_id                 = "" -> null
      - private_fqdn                        = "" -> null
      - private_link_enabled                = false -> null
      - public_network_access_enabled       = true -> null
      - resource_group_name                 = "notejam-prod-rg" -> null
      - sku_tier                            = "Free" -> null
      - tags                                = {
          - "environment" = "production"
        } -> null

      - addon_profile {
          - aci_connector_linux {
              - enabled = false -> null
            }

          - azure_keyvault_secrets_provider {
              - enabled                 = false -> null
              - secret_identity         = [] -> null
              - secret_rotation_enabled = false -> null
            }

          - azure_policy {
              - enabled = false -> null
            }

          - http_application_routing {
              - enabled = false -> null
            }

          - ingress_application_gateway {
              - enabled                              = false -> null
              - ingress_application_gateway_identity = [] -> null
            }

          - kube_dashboard {
              - enabled = false -> null
            }

          - oms_agent {
              - enabled            = false -> null
              - oms_agent_identity = [] -> null
            }

          - open_service_mesh {
              - enabled = false -> null
            }
        }

      - default_node_pool {
          - availability_zones           = [] -> null
          - enable_auto_scaling          = false -> null
          - enable_host_encryption       = false -> null
          - enable_node_public_ip        = false -> null
          - fips_enabled                 = false -> null
          - kubelet_disk_type            = "OS" -> null
          - max_count                    = 0 -> null
          - max_pods                     = 110 -> null
          - min_count                    = 0 -> null
          - name                         = "prdwesteur" -> null
          - node_count                   = 2 -> null
          - node_labels                  = {} -> null
          - node_taints                  = [] -> null
          - only_critical_addons_enabled = false -> null
          - orchestrator_version         = "1.21.7" -> null
          - os_disk_size_gb              = 30 -> null
          - os_disk_type                 = "Managed" -> null
          - os_sku                       = "Ubuntu" -> null
          - tags                         = {} -> null
          - type                         = "VirtualMachineScaleSets" -> null
          - ultra_ssd_enabled            = false -> null
          - vm_size                      = "Standard_D2_v2" -> null
        }

      - network_profile {
          - dns_service_ip     = "10.0.0.10" -> null
          - docker_bridge_cidr = "172.17.0.1/16" -> null
          - load_balancer_sku  = "Standard" -> null
          - network_plugin     = "kubenet" -> null
          - outbound_type      = "loadBalancer" -> null
          - pod_cidr           = "10.244.0.0/16" -> null
          - service_cidr       = "10.0.0.0/16" -> null

          - load_balancer_profile {
              - effective_outbound_ips    = [
                  - "/subscriptions/1dfa3ab0-d7c3-40ca-9db1-41c3a35266e7/resourceGroups/MC_notejam-prod-rg_k8s-prod-westeurope-cluster_westeurope/providers/Microsoft.Network/publicIPAddresses/702345d5-ca03-4eda-a948-052c45321bb5",
                ] -> null
              - idle_timeout_in_minutes   = 0 -> null
              - managed_outbound_ip_count = 1 -> null
              - outbound_ip_address_ids   = [] -> null
              - outbound_ip_prefix_ids    = [] -> null
              - outbound_ports_allocated  = 0 -> null
            }
        }

      - role_based_access_control {
          - enabled = true -> null
        }

      - service_principal {
          - client_id     = "dd0bfe25-d74d-4538-94f4-f8d623787b6f" -> null
          - client_secret = (sensitive value)
        }
    }

  # module.notejam-infra-production-regional_pair_a.azurerm_resource_group.main has changed
  ~ resource "azurerm_resource_group" "main" {
        id       = "/subscriptions/1dfa3ab0-d7c3-40ca-9db1-41c3a35266e7/resourceGroups/notejam-prod-rg"
      ~ location = "westeurope" -> "northeurope"
        name     = "notejam-prod-rg"
        tags     = {
            "environment" = "production"
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.notejam-acr-georeplicated.azurerm_container_registry.main will be created
  + resource "azurerm_container_registry" "main" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + georeplication_locations      = (known after apply)
      + georeplications               = [
          + {
              + location                  = "westeurope"
              + regional_endpoint_enabled = null
              + tags                      = null
              + zone_redundancy_enabled   = true
            },
          + {
              + location                  = "westeurope"
              + regional_endpoint_enabled = null
              + tags                      = null
              + zone_redundancy_enabled   = true
            },
        ]
      + id                            = (known after apply)
      + location                      = "westeurope"
      + login_server                  = (known after apply)
      + name                          = "notejamprod"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "notejam-prod-rg"
      + retention_policy              = (known after apply)
      + sku                           = "premium"
      + storage_account_id            = (known after apply)
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.notejam-acr-georeplicated.azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "notejam-prod-rg"
    }

  # module.notejam-infra-production-regional_pair_a.azurerm_kubernetes_cluster.main will be created
  + resource "azurerm_kubernetes_cluster" "main" {
      + dns_prefix                          = "k8s-prod-westeurope-cluster"
      + fqdn                                = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (known after apply)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (known after apply)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "westeurope"
      + name                                = "k8s-prod-westeurope-cluster"
      + node_resource_group                 = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = (known after apply)
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + private_link_enabled                = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "notejam-prod-rg"
      + sku_tier                            = "Free"
      + tags                                = {
          + "environment" = "production"
        }

      + addon_profile {
          + aci_connector_linux {
              + enabled     = (known after apply)
              + subnet_name = (known after apply)
            }

          + azure_keyvault_secrets_provider {
              + enabled                  = (known after apply)
              + secret_identity          = (known after apply)
              + secret_rotation_enabled  = (known after apply)
              + secret_rotation_interval = (known after apply)
            }

          + azure_policy {
              + enabled = (known after apply)
            }

          + http_application_routing {
              + enabled                            = (known after apply)
              + http_application_routing_zone_name = (known after apply)
            }

          + ingress_application_gateway {
              + effective_gateway_id                 = (known after apply)
              + enabled                              = (known after apply)
              + gateway_id                           = (known after apply)
              + gateway_name                         = (known after apply)
              + ingress_application_gateway_identity = (known after apply)
              + subnet_cidr                          = (known after apply)
              + subnet_id                            = (known after apply)
            }

          + kube_dashboard {
              + enabled = (known after apply)
            }

          + oms_agent {
              + enabled                    = (known after apply)
              + log_analytics_workspace_id = (known after apply)
              + oms_agent_identity         = (known after apply)
            }

          + open_service_mesh {
              + enabled = (known after apply)
            }
        }

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + empty_bulk_delete_max            = (known after apply)
          + expander                         = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + max_node_provisioning_time       = (known after apply)
          + max_unready_nodes                = (known after apply)
          + max_unready_percentage           = (known after apply)
          + new_pod_scale_up_delay           = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
          + skip_nodes_with_local_storage    = (known after apply)
          + skip_nodes_with_system_pods      = (known after apply)
        }

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "prdwesteur"
          + node_count           = 2
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = 30
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_D2_v2"
        }

      + kubelet_identity {
          + client_id                 = (known after apply)
          + object_id                 = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + load_balancer_sku  = (known after apply)
          + network_mode       = (known after apply)
          + network_plugin     = (known after apply)
          + network_policy     = (known after apply)
          + outbound_type      = (known after apply)
          + pod_cidr           = (known after apply)
          + service_cidr       = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
              + outbound_ip_address_ids   = (known after apply)
              + outbound_ip_prefix_ids    = (known after apply)
              + outbound_ports_allocated  = (known after apply)
            }

          + nat_gateway_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
            }
        }

      + role_based_access_control {
          + enabled = true
        }

      + service_principal {
          + client_id     = "dd0bfe25-d74d-4538-94f4-f8d623787b6f"
          + client_secret = (sensitive value)
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
          + license        = (known after apply)
        }
    }

  # module.notejam-infra-production-regional_pair_a.azurerm_resource_group.main must be replaced
-/+ resource "azurerm_resource_group" "main" {
      ~ id       = "/subscriptions/1dfa3ab0-d7c3-40ca-9db1-41c3a35266e7/resourceGroups/notejam-prod-rg" -> (known after apply)
      ~ location = "northeurope" -> "westeurope" # forces replacement
        name     = "notejam-prod-rg"
        tags     = {
            "environment" = "production"
        }
    }

  # module.notejam-infra-production-regional_pair_b.azurerm_kubernetes_cluster.main will be created
  + resource "azurerm_kubernetes_cluster" "main" {
      + dns_prefix                          = "k8s-prod-northeurope-cluster"
      + fqdn                                = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (known after apply)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (known after apply)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "northeurope"
      + name                                = "k8s-prod-northeurope-cluster"
      + node_resource_group                 = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = (known after apply)
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + private_link_enabled                = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "notejam-prod-rg"
      + sku_tier                            = "Free"
      + tags                                = {
          + "environment" = "production"
        }

      + addon_profile {
          + aci_connector_linux {
              + enabled     = (known after apply)
              + subnet_name = (known after apply)
            }

          + azure_keyvault_secrets_provider {
              + enabled                  = (known after apply)
              + secret_identity          = (known after apply)
              + secret_rotation_enabled  = (known after apply)
              + secret_rotation_interval = (known after apply)
            }

          + azure_policy {
              + enabled = (known after apply)
            }

          + http_application_routing {
              + enabled                            = (known after apply)
              + http_application_routing_zone_name = (known after apply)
            }

          + ingress_application_gateway {
              + effective_gateway_id                 = (known after apply)
              + enabled                              = (known after apply)
              + gateway_id                           = (known after apply)
              + gateway_name                         = (known after apply)
              + ingress_application_gateway_identity = (known after apply)
              + subnet_cidr                          = (known after apply)
              + subnet_id                            = (known after apply)
            }

          + kube_dashboard {
              + enabled = (known after apply)
            }

          + oms_agent {
              + enabled                    = (known after apply)
              + log_analytics_workspace_id = (known after apply)
              + oms_agent_identity         = (known after apply)
            }

          + open_service_mesh {
              + enabled = (known after apply)
            }
        }

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + empty_bulk_delete_max            = (known after apply)
          + expander                         = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + max_node_provisioning_time       = (known after apply)
          + max_unready_nodes                = (known after apply)
          + max_unready_percentage           = (known after apply)
          + new_pod_scale_up_delay           = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
          + skip_nodes_with_local_storage    = (known after apply)
          + skip_nodes_with_system_pods      = (known after apply)
        }

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "prdnortheur"
          + node_count           = 2
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = 30
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_D2_v2"
        }

      + kubelet_identity {
          + client_id                 = (known after apply)
          + object_id                 = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + load_balancer_sku  = (known after apply)
          + network_mode       = (known after apply)
          + network_plugin     = (known after apply)
          + network_policy     = (known after apply)
          + outbound_type      = (known after apply)
          + pod_cidr           = (known after apply)
          + service_cidr       = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
              + outbound_ip_address_ids   = (known after apply)
              + outbound_ip_prefix_ids    = (known after apply)
              + outbound_ports_allocated  = (known after apply)
            }

          + nat_gateway_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
            }
        }

      + role_based_access_control {
          + enabled = true
        }

      + service_principal {
          + client_id     = "dd0bfe25-d74d-4538-94f4-f8d623787b6f"
          + client_secret = (sensitive value)
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
          + license        = (known after apply)
        }
    }

  # module.notejam-infra-production-regional_pair_b.azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "notejam-prod-rg"
      + tags     = {
          + "environment" = "production"
        }
    }

Plan: 6 to add, 0 to change, 1 to destroy.


```

</details>

*Pusher: @marouanabbessi, Action: `pull_request`*